## Production: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 2 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                            NAME                            |
|----------|------------------------------------------------------------|
| update   | `aws_ecs_service.wordpress_service`                        |
|          | `aws_iam_policy.wordpress_ecs_task_get_secret_value`       |
| recreate | `aws_ecs_task_definition.wordpress_task`                   |
|          | `aws_secretsmanager_secret_version.default_notify_api_key` |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/gc-articles/actions/runs/6894766904).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wordpress_ecs_task_get_secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wordpress_ecs_task_get_secret_value" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB",
              + "arn:aws:secretsmanager:ca-central-1:472286471787:secret:zendesk_api_url_ptvk59-1Dsrpp",
              + (known after apply),
            ]
        }
    }

  # data.template_file.wordpress_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "wordpress_container_definition" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + essential        = true
                  + image            = "${APACHE_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "apache"
                  + portMappings     = [
                      + {
                          + containerPort = 443
                          + hostPort      = 443
                          + protocol      = "tcp"
                        },
                    ]
                  + volumesFrom      = [
                      + {
                          + readOnly        = true
                          + sourceContainer = "wordpress"
                        },
                    ]
                },
              + {
                  + environment      = [
                      + {
                          + name  = "DEFAULT_DOMAIN"
                          + value = "${DEFAULT_DOMAIN}"
                        },
                      + {
                          + name  = "S3_UPLOADS_BUCKET_URL"
                          + value = "${S3_UPLOADS_BUCKET_URL}"
                        },
                      + {
                          + name  = "WORDPRESS_CONFIG_EXTRA"
                          + value = "${WORDPRESS_CONFIG_EXTRA}"
                        },
                      + {
                          + name  = "C3_DISTRIBUTION_ID"
                          + value = "${C3_DISTRIBUTION_ID}"
                        },
                    ]
                  + essential        = true
                  + image            = "${WORDPRESS_IMAGE}"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${AWS_LOGS_GROUP}"
                          + awslogs-region        = "${AWS_LOGS_REGION}"
                          + awslogs-stream-prefix = "${AWS_LOGS_STREAM_PREFIX}"
                        }
                    }
                  + name             = "wordpress"
                  + portMappings     = [
                      + {
                          + containerPort = 9000
                          + hostPort      = 9000
                          + protocol      = "tcp"
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "LIST_MANAGER_ENDPOINT"
                          + valueFrom = "${LIST_MANAGER_ENDPOINT}"
                        },
                      + {
                          + name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          + valueFrom = "${DEFAULT_LIST_MANAGER_API_KEY}"
                        },
                      + {
                          + name      = "DEFAULT_NOTIFY_API_KEY"
                          + valueFrom = "${DEFAULT_NOTIFY_API_KEY}"
                        },
                      + {
                          + name      = "ENCRYPTION_KEY"
                          + valueFrom = "${ENCRYPTION_KEY}"
                        },
                      + {
                          + name      = "S3_UPLOADS_BUCKET"
                          + valueFrom = "${S3_UPLOADS_BUCKET}"
                        },
                      + {
                          + name      = "S3_UPLOADS_KEY"
                          + valueFrom = "${S3_UPLOADS_KEY}"
                        },
                      + {
                          + name      = "S3_UPLOADS_SECRET"
                          + valueFrom = "${S3_UPLOADS_SECRET}"
                        },
                      + {
                          + name      = "C3_AWS_ACCESS_KEY_ID"
                          + valueFrom = "${C3_AWS_ACCESS_KEY_ID}"
                        },
                      + {
                          + name      = "C3_AWS_SECRET_ACCESS_KEY"
                          + valueFrom = "${C3_AWS_SECRET_ACCESS_KEY}"
                        },
                      + {
                          + name      = "JWT_AUTH_SECRET_KEY"
                          + valueFrom = "${JWT_AUTH_SECRET_KEY}"
                        },
                      + {
                          + name      = "WPML_SITE_KEY"
                          + valueFrom = "${WPML_SITE_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_HOST"
                          + valueFrom = "${WORDPRESS_DB_HOST}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_USER"
                          + valueFrom = "${WORDPRESS_DB_USER}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_PASSWORD"
                          + valueFrom = "${WORDPRESS_DB_PASSWORD}"
                        },
                      + {
                          + name      = "WORDPRESS_DB_NAME"
                          + valueFrom = "${WORDPRESS_DB_NAME}"
                        },
                      + {
                          + name      = "WORDPRESS_AUTH_KEY"
                          + valueFrom = "${WORDPRESS_AUTH_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_SECURE_AUTH_KEY"
                          + valueFrom = "${WORDPRESS_SECURE_AUTH_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_LOGGED_IN_KEY"
                          + valueFrom = "${WORDPRESS_LOGGED_IN_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_NONCE_KEY"
                          + valueFrom = "${WORDPRESS_NONCE_KEY}"
                        },
                      + {
                          + name      = "WORDPRESS_AUTH_SALT"
                          + valueFrom = "${WORDPRESS_AUTH_SALT}"
                        },
                      + {
                          + name      = "WORDPRESS_SECURE_AUTH_SALT"
                          + valueFrom = "${WORDPRESS_SECURE_AUTH_SALT}"
                        },
                      + {
                          + name      = "WORDPRESS_LOGGED_IN_SALT"
                          + valueFrom = "${WORDPRESS_LOGGED_IN_SALT}"
                        },
                      + {
                          + name      = "WORDPRESS_NONCE_SALT"
                          + valueFrom = "${WORDPRESS_NONCE_SALT}"
                        },
                      + {
                          + name      = "ZENDESK_API_URL"
                          + valueFrom = "${ZENDESK_API_URL}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "APACHE_IMAGE"                 = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.1.1"
          + "AWS_LOGS_GROUP"               = "/aws/ecs/wordpress"
          + "AWS_LOGS_REGION"              = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"       = "wordpress-task"
          + "C3_AWS_ACCESS_KEY_ID"         = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU"
          + "C3_AWS_SECRET_ACCESS_KEY"     = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT"
          + "C3_DISTRIBUTION_ID"           = "E1HX1N6D5W92G9"
          + "DEFAULT_DOMAIN"               = "articles.alpha.canada.ca"
          + "DEFAULT_LIST_MANAGER_API_KEY" = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew"
          + "DEFAULT_NOTIFY_API_KEY"       = (known after apply)
          + "ENABLE_EFS"                   = "false"
          + "ENCRYPTION_KEY"               = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD"
          + "JWT_AUTH_SECRET_KEY"          = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD"
          + "LIST_MANAGER_ENDPOINT"        = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7"
          + "S3_UPLOADS_BUCKET"            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew"
          + "S3_UPLOADS_BUCKET_URL"        = "https://articles.alpha.canada.ca"
          + "S3_UPLOADS_KEY"               = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3"
          + "S3_UPLOADS_SECRET"            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7"
          + "WORDPRESS_AUTH_KEY"           = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j"
          + "WORDPRESS_AUTH_SALT"          = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7"
          + "WORDPRESS_CONFIG_EXTRA"       = "define('WP_HOME','https://articles.alpha.canada.ca');define('WP_SITEURL','https://articles.alpha.canada.ca');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
          + "WORDPRESS_DB_HOST"            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR"
          + "WORDPRESS_DB_NAME"            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n"
          + "WORDPRESS_DB_PASSWORD"        = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ"
          + "WORDPRESS_DB_USER"            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP"
          + "WORDPRESS_IMAGE"              = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v3.13.0"
          + "WORDPRESS_LOGGED_IN_KEY"      = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S"
          + "WORDPRESS_LOGGED_IN_SALT"     = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx"
          + "WORDPRESS_NONCE_KEY"          = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54"
          + "WORDPRESS_NONCE_SALT"         = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM"
          + "WORDPRESS_SECURE_AUTH_KEY"    = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7"
          + "WORDPRESS_SECURE_AUTH_SALT"   = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv"
          + "WPML_SITE_KEY"                = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB"
          + "ZENDESK_API_URL"              = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:zendesk_api_url_ptvk59-1Dsrpp"
        }
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:472286471787:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:76" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task must be replaced
-/+ resource "aws_ecs_task_definition" "wordpress_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress:76" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:472286471787:task-definition/wordpress" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = []
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/apache:v1.1.1"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "apache"
                  - portMappings     = [
                      - {
                          - containerPort = 443
                          - hostPort      = 443
                          - protocol      = "tcp"
                        },
                    ]
                  - volumesFrom      = [
                      - {
                          - readOnly        = true
                          - sourceContainer = "wordpress"
                        },
                    ]
                },
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "C3_DISTRIBUTION_ID"
                          - value = "E1HX1N6D5W92G9"
                        },
                      - {
                          - name  = "DEFAULT_DOMAIN"
                          - value = "articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "S3_UPLOADS_BUCKET_URL"
                          - value = "https://articles.alpha.canada.ca"
                        },
                      - {
                          - name  = "WORDPRESS_CONFIG_EXTRA"
                          - value = "define('WP_HOME','https://articles.alpha.canada.ca');define('WP_SITEURL','https://articles.alpha.canada.ca');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
                        },
                    ]
                  - essential        = true
                  - image            = "472286471787.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v3.13.0"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/wordpress"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "wordpress-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "wordpress"
                  - portMappings     = [
                      - {
                          - containerPort = 9000
                          - hostPort      = 9000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "LIST_MANAGER_ENDPOINT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "DEFAULT_LIST_MANAGER_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "DEFAULT_NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "ENCRYPTION_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD"
                        },
                      - {
                          - name      = "S3_UPLOADS_BUCKET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew"
                        },
                      - {
                          - name      = "S3_UPLOADS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3"
                        },
                      - {
                          - name      = "S3_UPLOADS_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7"
                        },
                      - {
                          - name      = "C3_AWS_ACCESS_KEY_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU"
                        },
                      - {
                          - name      = "C3_AWS_SECRET_ACCESS_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT"
                        },
                      - {
                          - name      = "JWT_AUTH_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD"
                        },
                      - {
                          - name      = "WPML_SITE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB"
                        },
                      - {
                          - name      = "WORDPRESS_DB_HOST"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR"
                        },
                      - {
                          - name      = "WORDPRESS_DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP"
                        },
                      - {
                          - name      = "WORDPRESS_DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ"
                        },
                      - {
                          - name      = "WORDPRESS_DB_NAME"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54"
                        },
                      - {
                          - name      = "WORDPRESS_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7"
                        },
                      - {
                          - name      = "WORDPRESS_SECURE_AUTH_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv"
                        },
                      - {
                          - name      = "WORDPRESS_LOGGED_IN_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx"
                        },
                      - {
                          - name      = "WORDPRESS_NONCE_SALT"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM"
                        },
                      - {
                          - name      = "ZENDESK_API_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:zendesk_api_url_ptvk59-1Dsrpp"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "wordpress" -> (known after apply)
      ~ revision                 = 76 -> (known after apply)
        tags                     = {
            "CostCentre" = "PlatformGCArticles"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::472286471787:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:zendesk_api_url_ptvk59-1Dsrpp",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wpml_site_key_ptvk59-WpQBaB",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_salt_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_secure_auth_key_ptvk59-9SWXj7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_salt_ptvk59-WcvWSM",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_nonce_key_ptvk59-8KYC54",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_salt_ptvk59-zGhyxx",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_logged_in_key_ptvk59-bqgc4S",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_username_9shuao-3zc5KP",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_password_9shuao-FA63fQ",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_name_9shuao-SF8e8n",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_database_host_9shuao-uAbPIR",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_salt_ptvk59-WeE8z7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:wordpress_auth_key_ptvk59-3e0G4j",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_secret_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_key_ptvk59-Z8ZEB3",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:s3_uploads_bucket_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:list_manager_endpoint_ptvk59-ngOqW7",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:jwt_auth_secret_key_ptvk59-5wsjGD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:encryption_key_ptvk59-1SdDHD",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_list_manager_api_key_ptvk59-YXq6Ew",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_secret_access_key_ptvk59-VlIGTT",
                          - "arn:aws:secretsmanager:ca-central-1:472286471787:secret:c3_aws_access_key_id_ptvk59-Nn4jAU",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.default_notify_api_key must be replaced
-/+ resource "aws_secretsmanager_secret_version" "default_notify_api_key" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:472286471787:secret:default_notify_api_key_ptvk59-IVd2Rv|6CFAD7C3-9783-4F1E-8F4A-A6A4CE52E115" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "6CFAD7C3-9783-4F1E-8F4A-A6A4CE52E115" -> (known after apply)
      ~ version_stages = [
          - "AWSPREVIOUS",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 2 to...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.wordpress_ecs_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.wordpress"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.wordpress_service"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.wordpress_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_ecr_image"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.wordpress_ecs_task_get_secret_value"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ecs_events_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.wordpress_ecs_task"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.ecs_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_access_key_id"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.c3_aws_secret_access_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_list_manager_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.default_notify_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.encryption_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.jwt_auth_secret_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.list_manager_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.s3_uploads_key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
